7767517
241 291
Input                    in0                      0 1 in0
Convolution              conv_73                  1 1 in0 1 0=16 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=432
Swish                    silu_12                  1 1 1 2
Convolution              conv_74                  1 1 2 3 0=32 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=4608
Swish                    silu_13                  1 1 3 4
Convolution              conv_75                  1 1 4 5 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024
Swish                    silu_14                  1 1 5 6
Slice                    split_0                  1 2 6 7 8 -23300=2,16,16 1=0
Split                    splitncnn_0              1 3 8 9 10 11
Convolution              conv_76                  1 1 11 12 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304
Swish                    silu_15                  1 1 12 13
Convolution              conv_77                  1 1 13 14 0=16 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=2304
Split                    splitncnn_1              1 2 14 15 16
Sigmoid                  sigmoid_5                1 1 16 17
BinaryOp                 mul_0                    2 1 15 17 18 0=2
BinaryOp                 add_1                    2 1 10 18 19 0=0
Concat                   cat_0                    3 1 7 9 19 20 0=0
Convolution              conv_78                  1 1 20 21 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1536
Swish                    silu_16                  1 1 21 22
Convolution              conv_79                  1 1 22 23 0=64 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=18432
Swish                    silu_17                  1 1 23 24
Convolution              conv_80                  1 1 24 25 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_18                  1 1 25 26
Slice                    split_1                  1 2 26 27 28 -23300=2,32,32 1=0
Split                    splitncnn_2              1 3 28 29 30 31
Convolution              conv_81                  1 1 31 32 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_19                  1 1 32 33
Convolution              conv_82                  1 1 33 34 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Split                    splitncnn_3              1 2 34 35 36
Sigmoid                  sigmoid_6                1 1 36 37
BinaryOp                 mul_2                    2 1 35 37 38 0=2
BinaryOp                 add_3                    2 1 30 38 39 0=0
Split                    splitncnn_4              1 3 39 40 41 42
Convolution              conv_83                  1 1 42 43 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_20                  1 1 43 44
Convolution              conv_84                  1 1 44 45 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Split                    splitncnn_5              1 2 45 46 47
Sigmoid                  sigmoid_7                1 1 47 48
BinaryOp                 mul_4                    2 1 46 48 49 0=2
BinaryOp                 add_5                    2 1 41 49 50 0=0
Concat                   cat_1                    4 1 27 29 40 50 51 0=0
Convolution              conv_85                  1 1 51 52 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=8192
Swish                    silu_21                  1 1 52 53
Split                    splitncnn_6              1 2 53 54 55
Convolution              conv_86                  1 1 55 56 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=73728
Swish                    silu_22                  1 1 56 57
Convolution              conv_87                  1 1 57 58 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_23                  1 1 58 59
Slice                    split_2                  1 2 59 60 61 -23300=2,64,64 1=0
Split                    splitncnn_7              1 3 61 62 63 64
Convolution              conv_88                  1 1 64 65 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_24                  1 1 65 66
Convolution              conv_89                  1 1 66 67 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Split                    splitncnn_8              1 2 67 68 69
Sigmoid                  sigmoid_8                1 1 69 70
BinaryOp                 mul_6                    2 1 68 70 71 0=2
BinaryOp                 add_7                    2 1 63 71 72 0=0
Split                    splitncnn_9              1 3 72 73 74 75
Convolution              conv_90                  1 1 75 76 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_25                  1 1 76 77
Convolution              conv_91                  1 1 77 78 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Split                    splitncnn_10             1 2 78 79 80
Sigmoid                  sigmoid_9                1 1 80 81
BinaryOp                 mul_8                    2 1 79 81 82 0=2
BinaryOp                 add_9                    2 1 74 82 83 0=0
Concat                   cat_2                    4 1 60 62 73 83 84 0=0
Convolution              conv_92                  1 1 84 85 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_26                  1 1 85 86
Split                    splitncnn_11             1 2 86 87 88
Convolution              conv_93                  1 1 88 89 0=256 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=294912
Swish                    silu_27                  1 1 89 90
Convolution              conv_94                  1 1 90 91 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_28                  1 1 91 92
Slice                    split_3                  1 2 92 93 94 -23300=2,128,128 1=0
Split                    splitncnn_12             1 3 94 95 96 97
Convolution              conv_95                  1 1 97 98 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_29                  1 1 98 99
Convolution              conv_96                  1 1 99 100 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Split                    splitncnn_13             1 2 100 101 102
Sigmoid                  sigmoid_10               1 1 102 103
BinaryOp                 mul_10                   2 1 101 103 104 0=2
BinaryOp                 add_11                   2 1 96 104 105 0=0
Concat                   cat_3                    3 1 93 95 105 106 0=0
Convolution              conv_97                  1 1 106 107 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=98304
Swish                    silu_30                  1 1 107 108
Convolution              conv_98                  1 1 108 109 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_31                  1 1 109 110
Split                    splitncnn_14             1 2 110 111 112
Pooling                  maxpool2d_2              1 1 112 113 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Split                    splitncnn_15             1 2 113 114 115
Pooling                  maxpool2d_3              1 1 115 116 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Split                    splitncnn_16             1 2 116 117 118
Pooling                  maxpool2d_4              1 1 118 119 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Concat                   cat_4                    4 1 111 114 117 119 120 0=0
Convolution              conv_99                  1 1 120 121 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Swish                    silu_32                  1 1 121 122
Split                    splitncnn_17             1 2 122 123 124
Interp                   interpolate_0            1 1 124 125 0=1 1=2.0 2=2.0 6=0
Concat                   cat_5                    2 1 125 87 126 0=0
Convolution              conv_100                 1 1 126 127 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=49152
Swish                    silu_33                  1 1 127 128
Slice                    split_4                  1 2 128 129 130 -23300=2,64,64 1=0
Split                    splitncnn_18             1 2 130 131 132
Convolution              conv_101                 1 1 132 133 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_34                  1 1 133 134
Convolution              conv_102                 1 1 134 135 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_35                  1 1 135 136
Concat                   cat_6                    3 1 129 131 136 137 0=0
Convolution              conv_103                 1 1 137 138 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24576
Swish                    silu_36                  1 1 138 139
Split                    splitncnn_19             1 2 139 140 141
Interp                   interpolate_1            1 1 141 142 0=1 1=2.0 2=2.0 6=0
Concat                   cat_7                    2 1 142 54 143 0=0
Convolution              conv_104                 1 1 143 144 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=12288
Swish                    silu_37                  1 1 144 145
Slice                    split_5                  1 2 145 146 147 -23300=2,32,32 1=0
Split                    splitncnn_20             1 2 147 148 149
Convolution              conv_105                 1 1 149 150 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_38                  1 1 150 151
Convolution              conv_106                 1 1 151 152 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_39                  1 1 152 153
Concat                   cat_8                    3 1 146 148 153 154 0=0
Convolution              conv_107                 1 1 154 155 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=6144
Swish                    silu_40                  1 1 155 156
Split                    splitncnn_21             1 5 156 157 158 159 160 161
Convolution              conv_108                 1 1 161 162 0=64 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=36864
Swish                    silu_41                  1 1 162 163
Concat                   cat_9                    2 1 163 140 164 0=0
Convolution              conv_109                 1 1 164 165 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24576
Swish                    silu_42                  1 1 165 166
Slice                    split_6                  1 2 166 167 168 -23300=2,64,64 1=0
Split                    splitncnn_22             1 2 168 169 170
Convolution              conv_110                 1 1 170 171 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_43                  1 1 171 172
Convolution              conv_111                 1 1 172 173 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_44                  1 1 173 174
Concat                   cat_10                   3 1 167 169 174 175 0=0
Convolution              conv_112                 1 1 175 176 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24576
Swish                    silu_45                  1 1 176 177
Split                    splitncnn_23             1 4 177 178 179 180 181
Convolution              conv_113                 1 1 181 182 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=147456
Swish                    silu_46                  1 1 182 183
Concat                   cat_11                   2 1 183 123 184 0=0
Convolution              conv_114                 1 1 184 185 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=98304
Swish                    silu_47                  1 1 185 186
Slice                    split_7                  1 2 186 187 188 -23300=2,128,128 1=0
Split                    splitncnn_24             1 2 188 189 190
Convolution              conv_115                 1 1 190 191 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_48                  1 1 191 192
Convolution              conv_116                 1 1 192 193 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_49                  1 1 193 194
Concat                   cat_12                   3 1 187 189 194 195 0=0
Convolution              conv_117                 1 1 195 196 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=98304
Swish                    silu_50                  1 1 196 197
Split                    splitncnn_25             1 3 197 198 199 200
Convolution              conv_118                 1 1 160 201 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_51                  1 1 201 202
Convolution              conv_119                 1 1 202 203 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_52                  1 1 203 204
Convolution              conv_120                 1 1 204 205 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Reshape                  reshape_152              1 1 205 206 0=6400 1=64
Convolution              conv_121                 1 1 180 207 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=73728
Swish                    silu_53                  1 1 207 208
Convolution              conv_122                 1 1 208 209 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_54                  1 1 209 210
Convolution              conv_123                 1 1 210 211 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Reshape                  reshape_153              1 1 211 212 0=1600 1=64
Convolution              conv_124                 1 1 200 213 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_55                  1 1 213 214
Convolution              conv_125                 1 1 214 215 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_56                  1 1 215 216
Convolution              conv_126                 1 1 216 217 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Reshape                  reshape_154              1 1 217 218 0=400 1=64
Concat                   cat_13                   3 1 206 212 218 219 0=1
Convolution              conv_127                 1 1 159 220 0=80 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=46080
Swish                    silu_57                  1 1 220 221
Convolution              conv_128                 1 1 221 222 0=80 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=57600
Swish                    silu_58                  1 1 222 223
Convolution              conv_129                 1 1 223 224 0=80 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=6400
Reshape                  reshape_155              1 1 224 225 0=6400 1=80
Convolution              conv_130                 1 1 179 226 0=80 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=92160
Swish                    silu_59                  1 1 226 227
Convolution              conv_131                 1 1 227 228 0=80 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=57600
Swish                    silu_60                  1 1 228 229
Convolution              conv_132                 1 1 229 230 0=80 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=6400
Reshape                  reshape_156              1 1 230 231 0=1600 1=80
Convolution              conv_133                 1 1 199 232 0=80 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=184320
Swish                    silu_61                  1 1 232 233
Convolution              conv_134                 1 1 233 234 0=80 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=57600
Swish                    silu_62                  1 1 234 235
Convolution              conv_135                 1 1 235 236 0=80 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=6400
Reshape                  reshape_157              1 1 236 237 0=400 1=80
Concat                   cat_14                   3 1 225 231 237 238 0=1
Convolution              conv_136                 1 1 158 239 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=18432
Swish                    silu_63                  1 1 239 240
Convolution              conv_137                 1 1 240 241 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_64                  1 1 241 242
Convolution              conv_138                 1 1 242 243 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024
Reshape                  reshape_158              1 1 243 244 0=6400 1=32
Convolution              conv_139                 1 1 178 245 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_65                  1 1 245 246
Convolution              conv_140                 1 1 246 247 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_66                  1 1 247 248
Convolution              conv_141                 1 1 248 249 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024
Reshape                  reshape_159              1 1 249 250 0=1600 1=32
Convolution              conv_142                 1 1 198 251 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=73728
Swish                    silu_67                  1 1 251 252
Convolution              conv_143                 1 1 252 253 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_68                  1 1 253 254
Convolution              conv_144                 1 1 254 255 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=1024
Reshape                  reshape_160              1 1 255 256 0=400 1=32
Concat                   cat_15                   3 1 244 250 256 257 0=1
Reshape                  reshape_161              1 1 219 258 0=8400 1=16 2=4
Permute                  permute_150              1 1 258 259 0=4
Softmax                  softmax_72               1 1 259 260 0=2 1=1
Permute                  permute_151              1 1 260 261 0=5
Convolution              conv_145                 1 1 261 262 0=1 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=16
Reshape                  reshape_162              1 1 262 263 0=8400 1=4
Slice                    tensor_split_0           1 2 263 264 265 -23300=2,2,-233 1=0
MemoryData               /model.22/Constant_15_output_0 0 1 266 0=8400 1=2
Split                    splitncnn_0              1 2 266 267 268
BinaryOp                 sub_12                   2 1 267 264 269 0=1
Split                    splitncnn_26             1 2 269 270 271
BinaryOp                 add_13                   2 1 268 265 272 0=0
Split                    splitncnn_27             1 2 272 273 274
BinaryOp                 add_14                   2 1 270 273 275 0=0
BinaryOp                 div_15                   1 1 275 276 0=3 1=1 2=2.0
BinaryOp                 sub_16                   2 1 274 271 277 0=1
Concat                   cat_16                   2 1 276 277 278 0=0
MemoryData               /model.22/Constant_18_output_0 0 1 279 0=8400
Reshape                  reshape_163              1 1 279 280 0=8400 1=1
BinaryOp                 mul_17                   2 1 278 280 281 0=2
Sigmoid                  sigmoid_11               1 1 238 282
Concat                   cat_17                   3 1 281 282 257 out0 0=0
Convolution              conv_146                 1 1 157 284 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_69                  1 1 284 285
Deconvolution            deconv_149               1 1 285 286 0=64 1=2 11=2 12=1 13=2 14=0 18=0 19=0 2=1 3=2 4=0 5=1 6=16384
Convolution              conv_147                 1 1 286 287 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_70                  1 1 287 288
Convolution              conv_148                 1 1 288 289 0=32 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=2048
Swish                    silu_71                  1 1 289 out1
